Revit 2027 API
ParameterTypeId.RebarBarHookLengths Property
 "Hook Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarHookLengths { get; }
Public Shared ReadOnly Property RebarBarHookLengths As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarHookLengths {
	ForgeTypeId^ get ();
}
static member RebarBarHookLengths : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace